eisup_2019_docmng_integration/src/Catalogs/абс_ТЭО/абс_ТЭО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ТЭО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидПроекта</name>
    <type>
      <types>CatalogRef.абс_ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТЭО</name>
    <type>
      <types>EnumRef.абс_ВидТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусСогласованияТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщиеИнвестиции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОкупаемостиПроекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрогнозируемыйРасходПроекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрогнозируемыйДоходПроекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительОтДЭИ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериодаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериодаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.КомиссияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуализация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникДопСогласование</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойИТР</name>
    <type>
      <types>CatalogRef.абс_ИТР</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТЭО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерSOR</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПроекта</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторМП</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>хТТК</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработкиТЭО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВынесенияНаИКК</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеТЭО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеБизнеса</name>
    <type>
      <types>CatalogRef.ttk_НаправлениеБизнеса</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИТР</name>
    <attributes>
      <name>ИТР</name>
      <type>
        <types>CatalogRef.абс_ИТР</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерИТР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказчик</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПереченьУчастниковСогласованияТЭО</name>
    <attributes>
      <name>ОтветственноеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПлановыеПоказатели</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДохода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасхода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовТЭО/абс_ИзменениеСтатусовТЭО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИзменениеСтатусовТЭО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственного</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусСогласованияТЭО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусСогласованияТЭО/абс_СтатусСогласованияТЭО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусСогласованияТЭО</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>РазработкаИТРТЭО</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеИК</name>
  </enumValues>
  <enumValues>
    <name>РазработкаИТРДП</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭФ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросИнформации</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтработан</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_ВидТЭО/абс_ВидТЭО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидТЭО</name>
  <enumValues>
    <name>ТЭО</name>
  </enumValues>
  <enumValues>
    <name>ЭкспрессТЭО</name>
  </enumValues>
  <enumValues>
    <name>БюджетнаяОценка</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/абс_ТЭО/ManagerModule.bsl
Процедура ЗаполнитьСписокДоступныхСтатусов(Список, Ссылка,мРолиПользователя,мТекущийПользователь) Экспорт	
	
	Список.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Подготовка);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ссылка.Статус) Тогда
		Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Подготовка);
		Возврат;
	Иначе
		Список.Добавить(Ссылка.Статус);
	КонецЕсли;
	
	СотрудникДопСогласование = Справочники.Пользователи.ПустаяСсылка();
	МассивПользователей = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(Ссылка.СотрудникДопСогласование);
	Если МассивПользователей.Количество() > 0 Тогда
		СотрудникДопСогласование = МассивПользователей[0];
	КонецЕсли;
	
	
	Если Ссылка.ВидТЭО = Перечисления.абс_ВидТЭО.ТЭО и Не Ссылка.Актуализация Тогда     //ВСТАВКА Проектный учет 171213 Родин
		Если Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.Подготовка Тогда
			
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.ЗапросИнформации);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.РазработкаИТРТЭО);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
			
			//ВСТАВКА Проектный учет 191213 Родин	
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.ЗапросИнформации и мТекущийПользователь = СотрудникДопСогласование Тогда
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.ЗапросОтработан);
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.ЗапросОтработан и мТекущийПользователь = Ссылка.Ответственный Тогда
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Подготовка);
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.РазработкаИТРТЭО и мРолиПользователя.Найти(Справочники.РолиИсполнителей.РазработкаИТРТЭО) <> Неопределено Тогда
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.СогласованиеДЭФ);
			//Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.СогласованиеИК);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.СогласованиеДЭФ  и мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеДЭИ) <> Неопределено Тогда
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.СогласованиеИК);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
			//ВСТАВКА Проектный учет 191213 Родин
			
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.СогласованиеИК  и мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеИК) <> Неопределено Тогда	
			
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.РазработкаИТРДП);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
			
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.РазработкаИТРДП  и мРолиПользователя.Найти(Справочники.РолиИсполнителей.РазработкаИТРДП) <> Неопределено Тогда	
			
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Согласован);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
			
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.Отказ  и мТекущийПользователь = Ссылка.Ответственный Тогда	
			
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Подготовка);
			
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.Согласован  и мТекущийПользователь = Ссылка.Ответственный Тогда
			
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
			
		КонецЕсли;
	ИначеЕсли Ссылка.ВидТЭО = Перечисления.абс_ВидТЭО.ЭкспрессТЭО или Ссылка.Актуализация Тогда 
		Если Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.Подготовка Тогда
			
			//ВСТАВКА Проектный учет 191213 Родин
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.ЗапросИнформации);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.СогласованиеДЭФ);
			//Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.СогласованиеИК);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.ЗапросИнформации  и мТекущийПользователь = СотрудникДопСогласование Тогда
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.ЗапросОтработан);
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.ЗапросОтработан   и мТекущийПользователь = Ссылка.Ответственный Тогда
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Подготовка);
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.СогласованиеДЭФ   и мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеДЭИ) <> Неопределено Тогда
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.СогласованиеИК);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
			//ВСТАВКА Проектный учет 191213 Родин
			
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.СогласованиеИК  и мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеИК) <> Неопределено  Тогда
			
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Согласован);
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
			
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.Отказ  и мТекущийПользователь = Ссылка.Ответственный Тогда	
			
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Подготовка);
			
		ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусСогласованияТЭО.Согласован   и мТекущийПользователь = Ссылка.Ответственный  Тогда
			
			Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Отказ);
			
		КонецЕсли;
		
	ИначеЕсли Ссылка.ВидТЭО = Перечисления.абс_ВидТЭО.БюджетнаяОценка Тогда
		Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Согласован);
		Список.Добавить(Перечисления.абс_СтатусСогласованияТЭО.Подготовка);
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьСтатусТЭО(Ссылка) Экспорт 
	
	ЗапросСтатус = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                            |	абс_ИзменениеСтатусовЗаявокНаОбеспечениеТМЦСрезПоследних.Статус КАК СтатусДокумента,
	                            |	абс_ИзменениеСтатусовЗаявокНаОбеспечениеТМЦСрезПоследних.Период КАК Период
	                            |ИЗ
	                            |	РегистрСведений.абс_ИзменениеСтатусовТЭО.СрезПоследних(&Период, ТЭО = &ТЭО) КАК абс_ИзменениеСтатусовЗаявокНаОбеспечениеТМЦСрезПоследних
	                            |
	                            |УПОРЯДОЧИТЬ ПО
	                            |	Период УБЫВ");
	ЗапросСтатус.УстановитьПараметр("Период"	, Новый Граница(абс_СерверныеФункции.ПолучитьДатуСервера(), ВидГраницы.Включая));
	ЗапросСтатус.УстановитьПараметр("ТЭО"	, Ссылка);
	
	ВыборкаСтатус = ЗапросСтатус.Выполнить().Выбрать();
	                                                              
	ТекСтатус = Неопределено;
	Если ВыборкаСтатус.Следующий() Тогда
		ТекСтатус = ВыборкаСтатус.СтатусДокумента;
	КонецЕсли;
	
	Возврат ТекСтатус;
	
КонецФункции
